package names

import "math/rand"

var FirstNames = []string{
	"Алексей", "Андрей", "Артём", "Борис", "Вадим",
	"Валерий", "Виктор", "Владимир", "Дмитрий", "Евгений",
	"Иван", "Игорь", "Кирилл", "Максим", "Николай",
	"Олег", "Павел", "Роман", "Сергей", "Фёдор",
	"Анна", "Вера", "Галина", "Дарья", "Елена",
	"Жанна", "Зинаида", "Ирина", "Ксения", "Любовь",
	"Мария", "Наталья", "Ольга", "Полина", "Раиса",
	"Светлана", "Татьяна", "Ульяна", "Юлия", "Яна",
}

var LastNames = []string{
	"Соколов", "Иванов", "Козлов", "Кузнецов", "Орлов",
	"Петров", "Смирнов", "Волков", "Морозов", "Новиков",
	"Лебедев", "Ковалёв", "Попов", "Фёдоров", "Белов",
	"Зайцев", "Павлов", "Егоров", "Романов", "Воробьёв",
	"Сидоров", "Кузьмин", "Филиппов", "Борисов", "Яковлев",
	"Григорьев", "Андреев", "Степанов", "Николаев", "Данилов",
}

func GenerateName() string {
	firstName := FirstNames[rand.Intn(len(FirstNames))]
	lastName := LastNames[rand.Intn(len(LastNames))]
	return firstName + " " + lastName
}
